/* ************************************************************************** */
/** Descriptive File Name

  @Company
    Company Name

  @File Name
    filename.c

  @Summary
    Brief description of the file.

  @Description
    Describe the purpose of this file.
 */
/* ************************************************************************** */
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdlib.h>
#include "KeyCodeDef.h"
#include "i2cLCD.h"
#include "MyLib.h"



// キーマップのインデックス
// この値は、app2で定義されている割り込み処理で変更される。
// RESETがストローブされると、この値が1 になる。SELECTの立ち下がりでこの値は＋１される。
volatile uint8_t KeyMapIdx = 0;                  // キーマップのインデックス。
uint8_t GetKeyMapIdx(void) {return KeyMapIdx;}

uint8_t keyMap[2][10];              // キーマップ。ダブルバッファにする。
uint8_t USBReportCount=0;           // USBのレポートカウント



SemaphoreHandle_t mtxKeyMap;
// キーボードの配列モード。BSの位置とかが違いすぎるのでイラっと来て実装した。F11…FCモード（デフォルト）、F12…PCモード
static int KeyMode = 0;
static struct CVTTable{
    uint8_t keyCode;
    uint8_t Row;
    uint8_t Column;
} cvt[2][122] = 
{
    {//あ
        {0x00,0,0b00000000},//        
        {0x01,0,0b00000000},//         
        {0x02,0,0b00000000},//       
        {0x03,0,0b00000000},//       
        {0x04,7,0b00010000},//  31 A   
        {0x05,5,0b00001000},//  50 B   
        {0x06,6,0b00000100},//  48 C   
        {0x07,6,0b00010000},//  33 D   
        {0x08,7,0b00000010},//  19 E   
        {0x09,6,0b00001000},//  34 F   
        {0x0A,5,0b00100000},//  35 G   
        {0x0B,5,0b00010000},//  36 H   
        {0x0C,4,0b01000000},//  24 I   
        {0x0D,4,0b00010000},//  37 J   
        {0x0E,3,0b00010000},//  38 K   
        {0x0F,3,0b00100000},//  39 L   
        {0x10,4,0b00001000},//  52 M   
        {0x11,4,0b00000100},//  51 N   
        {0x12,3,0b01000000},//  25 O   
        {0x13,3,0b00000010},//  26 P   
        {0x14,8,0b00100000},//  17 Q   
        {0x15,6,0b00100000},//  20 R   
        {0x16,7,0b00100000},//  32 S   
        {0x17,6,0b01000000},//  21 T   
        {0x18,4,0b00100000},//  23 U   
        {0x19,5,0b00000100},//  49 V   
        {0x1A,7,0b01000000},//  18 W   
        {0x1B,7,0b00001000},//  47 X   
        {0x1C,5,0b01000000},//  22 Y   
        {0x1D,7,0b00000100},//  46 Z   
        {0x1E,8,0b00000010},//  2 1 !   
        {0x1F,8,0b00000001},//  3 2 "   
        {0x20,7,0b00000001},//  4 3 #   
        {0x21,6,0b00000001},//  5 4 $   
        {0x22,6,0b00000010},//  6 5%   
        {0x23,5,0b00000001},//  7 6 &   
        {0x24,5,0b00000010},//  8 7 '   
        {0x25,4,0b00000001},//  9 8 (   
        {0x26,5,0b00000010},//  10 9 )   
        {0x27,3,0b00000001},//  11 0   
        {0x28,1,0b01000000},//  43 Enter   
        {0x29,8,0b01000000},//  110 Esc   
        {0x2A,1,0b00000001},//  15 Backspace   ⇒[STOP]
        {0x2B,8,0b01000000},//  16 Tab   ⇒[ESC]
        {0x2C,9,0b00000100},//  61 Spacebar   
        {0x2D,2,0b00000010},//  12 - =   
        {0x2E,2,0b00000001},//  13 ^ ~   
        {0x2F,2,0b01000000},//  27 @ `   
        {0x30,1,0b00100000},//  28 [ {   
        {0x31,1,0b00000000},//  29 \| (日本語キーでは定義なし）
        {0x32,1,0b00010000},//  42 ] }   
        {0x33,2,0b00010000},//  40 ; +   
        {0x34,2,0b00100000},//  41 : *   
        {0x35,0,0b00000000},//  1 半角/全角   ⇒割り当てなし
        {0x36,3,0b00001000},//  53 , <   
        {0x37,3,0b00000100},//  54 . >   
        {0x38,2,0b00000100},//  55 / ?   
        {0x39,8,0b00010000},//  30 英数 Caps Lock   ⇒ CTRL。位置が同じ。
        {0x3A,8,0b10000000},//  112 F1   
        {0x3B,7,0b10000000},//  113 F2   
        {0x3C,6,0b10000000},//  114 F3   
        {0x3D,5,0b10000000},//  115 F4   
        {0x3E,4,0b10000000},//  116 F5   
        {0x3F,3,0b10000000},//  117 F6   
        {0x40,2,0b10000000},//  118 F7   
        {0x41,1,0b10000000},//  119 F8   
        {0x42,0,0b00000000},//  120 F9   ⇒割り当てなし
        {0x43,0,0b00000000},//  121 F10  ⇒割り当てなし
        {0x44,0,0b00000000},//  122 F11  ⇒割り当てなし
        {0x45,0,0b00000000},//  123 F12  ⇒割り当てなし
        {0x46,0,0b00000000},//  124 PRTSC⇒割り当てなし
        {0x47,0,0b00000000},//  125 SCRLK⇒割り当てなし
        {0x48,0,0b00000000},//  126 Pause⇒割り当てなし
        {0x49,9,0b00000001},//  75 Insert
        {0x4A,9,0b10000000},//  80 Home   
        {0x4B,0,0b00000000},//  85 Page Up⇒割り当てなし
        {0x4C,9,0b00000010},//  76 Delete
        {0x4D,0,0b00000000},//  81 End   ⇒割り当てなし
        {0x4E,0,0b00000000},//  86 Page DN⇒割り当てなし
        {0x4F,9,0b00100000},//  89 →
        {0x50,9,0b00010000},//  79 ←
        {0x51,9,0b00001000},//  84 ↓   
        {0x52,9,0b01000000},//  83 ↑   
        {0x53,0,0b00000000},//  90 NumLock⇒割り当てなし
        {0x54,2,0b00000100},//  95 Keypad /⇒ / ? 
        {0x55,2,0b00010000},//  100 Keypad *⇒ *
        {0x56,2,0b00000010},//  105 Keypad -⇒ -
        {0x57,2,0b00100000},//  106 Keypad +⇒ +
        {0x58,1,0b01000000},//  108 Keypad Enter⇒ Enter
        {0x59,8,0b00000010},//  93 Keypad 1   ⇒１
        {0x5A,8,0b00000001},//  98 Keypad 2   
        {0x5B,7,0b00000001},//  103 Keypad 3   
        {0x5C,6,0b00000001},//  92 Keypad 4   
        {0x5D,6,0b00000010},//  97 Keypad 5   
        {0x5E,5,0b00000001},//  102 Keypad 6   
        {0x5F,5,0b00000010},//  91 Keypad 7   
        {0x60,4,0b00000001},//  96 Keypad 8   
        {0x61,5,0b00000010},//  101 Keypad 9   
        {0x62,3,0b00000001},//  99 Keypad 0   
        {0x63,3,0b00000100},//  104 Keypad .   
        {0x65,0,0b00000000},//  129 Application⇒割り当てなし   
        {0x67,0,0b00000000},//  303 ----- F13  ⇒割り当てなし   
        {0x68,0,0b00000000},//  300 ----- F14  ⇒割り当てなし   
        {0x69,0,0b00000000},//  301 ----- F15  ⇒割り当てなし   
        {0x6A,0,0b00000000},//  302 ----- Keypad =  ⇒割り当てなし   
        {0x85,0,0b00000000},//  304 ----- Keypad ,  ⇒割り当てなし  
        {0x87,2,0b00001000},//  56 ＼ _   ⇒ン　Shiftの隣
        {0x88,1,0b00001000},//  133 ひらがな カタカナ   ⇒　カナ
        {0x89,1,0b00000001},//  14 ￥ ｜   
        {0x8A,0,0b00000000},//  132 変換 ⇒割り当てなし
        {0x8B,8,0b00000100},//  131 無変換 ⇒ GRAPH  
        {0x90,0,0b00000000},//  306 -----カナ　⇒割り当てなし   
        {0x91,0,0b00000000},//  305 -----英数　⇒割り当てなし   
        {0xE0,8,0b00010000},//  58 Left Ctrl   
        {0xE1,8,0b00001000},//  44 Left Shift   
        {0xE2,0,0b00000000},//  60 Left Alt   ⇒割り当てなし
        {0xE3,0,0b00000000},//  127 Left Windows⇒割り当てなし   
        {0xE4,0,0b00000000},//  64 Right Ctrl⇒割り当てなし   
        {0xE5,1,0b00000100},//  57 Right Shift
        {0xE6,0,0b00000000},//  62 Right Alt  ⇒割り当てなし
        {0xE7,0,0b00000000},//  128 Right Windows  ⇒割り当てなし
        {0xFF,0,0} // endmark
    },
    {//あ
        {0x00,0,0b00000000},//        
        {0x01,0,0b00000000},//         
        {0x02,0,0b00000000},//       
        {0x03,0,0b00000000},//       
        {0x04,7,0b00010000},//  31 A   
        {0x05,5,0b00001000},//  50 B   
        {0x06,6,0b00000100},//  48 C   
        {0x07,6,0b00010000},//  33 D   
        {0x08,7,0b00000010},//  19 E   
        {0x09,6,0b00001000},//  34 F   
        {0x0A,5,0b00100000},//  35 G   
        {0x0B,5,0b00010000},//  36 H   
        {0x0C,4,0b01000000},//  24 I   
        {0x0D,4,0b00010000},//  37 J   
        {0x0E,3,0b00010000},//  38 K   
        {0x0F,3,0b00100000},//  39 L   
        {0x10,4,0b00001000},//  52 M   
        {0x11,4,0b00000100},//  51 N   
        {0x12,3,0b01000000},//  25 O   
        {0x13,3,0b00000010},//  26 P   
        {0x14,8,0b00100000},//  17 Q   
        {0x15,6,0b00100000},//  20 R   
        {0x16,7,0b00100000},//  32 S   
        {0x17,6,0b01000000},//  21 T   
        {0x18,4,0b00100000},//  23 U   
        {0x19,5,0b00000100},//  49 V   
        {0x1A,7,0b01000000},//  18 W   
        {0x1B,7,0b00001000},//  47 X   
        {0x1C,5,0b01000000},//  22 Y   
        {0x1D,7,0b00000100},//  46 Z   
        {0x1E,8,0b00000010},//  2 1 !   
        {0x1F,8,0b00000001},//  3 2 "   
        {0x20,7,0b00000001},//  4 3 #   
        {0x21,6,0b00000001},//  5 4 $   
        {0x22,6,0b00000010},//  6 5%   
        {0x23,5,0b00000001},//  7 6 &   
        {0x24,5,0b00000010},//  8 7 '   
        {0x25,4,0b00000001},//  9 8 (   
        {0x26,5,0b00000010},//  10 9 )   
        {0x27,3,0b00000001},//  11 0   
        {0x28,1,0b01000000},//  43 Enter   
        {0x29,8,0b01000000},//  110 Esc   
        {0x2A,9,0b00000010},//  15 Backspace   ⇒[DEL]
        {0x2B,8,0b01000000},//  16 Tab   ⇒[ESC]
        {0x2C,9,0b00000100},//  61 Spacebar   
        {0x2D,2,0b00000010},//  12 - =   
        {0x2E,2,0b00000001},//  13 ^ ~   
        {0x2F,2,0b01000000},//  27 @ `   
        {0x30,1,0b00100000},//  28 [ {   
        {0x31,1,0b00000000},//  29 \| (日本語キーでは定義なし）
        {0x32,1,0b00010000},//  42 ] }   
        {0x33,2,0b00010000},//  40 ; +   
        {0x34,2,0b00100000},//  41 : *   
        {0x35,1,0b00000001},//  1 半角/全角   ⇒ [STOP]
        {0x36,3,0b00001000},//  53 , <   
        {0x37,3,0b00000100},//  54 . >   
        {0x38,2,0b00000100},//  55 / ?   
        {0x39,8,0b00010000},//  30 英数 Caps Lock   ⇒ CTRL。位置が同じ。
        {0x3A,8,0b10000000},//  112 F1   
        {0x3B,7,0b10000000},//  113 F2   
        {0x3C,6,0b10000000},//  114 F3   
        {0x3D,5,0b10000000},//  115 F4   
        {0x3E,4,0b10000000},//  116 F5   
        {0x3F,3,0b10000000},//  117 F6   
        {0x40,2,0b10000000},//  118 F7   
        {0x41,1,0b10000000},//  119 F8   
        {0x42,0,0b00000000},//  120 F9   ⇒割り当てなし
        {0x43,0,0b00000000},//  121 F10  ⇒割り当てなし
        {0x44,0,0b00000000},//  122 F11  ⇒特殊処理
        {0x45,0,0b00000000},//  123 F12  ⇒特殊処理
        {0x46,0,0b00000000},//  124 PRTSC⇒割り当てなし
        {0x47,0,0b00000000},//  125 SCRLK⇒割り当てなし
        {0x48,0,0b00000000},//  126 Pause⇒割り当てなし
        {0x49,9,0b00000001},//  75 Insert
        {0x4A,9,0b10000000},//  80 Home   
        {0x4B,0,0b00000000},//  85 Page Up⇒割り当てなし
        {0x4C,9,0b00000010},//  76 Delete
        {0x4D,0,0b00000000},//  81 End   ⇒割り当てなし
        {0x4E,0,0b00000000},//  86 Page DN⇒割り当てなし
        {0x4F,9,0b00100000},//  89 →
        {0x50,9,0b00010000},//  79 ←
        {0x51,9,0b00001000},//  84 ↓   
        {0x52,9,0b01000000},//  83 ↑   
        {0x53,0,0b00000000},//  90 NumLock⇒割り当てなし
        {0x54,2,0b00000100},//  95 Keypad /⇒ / ? 
        {0x55,2,0b00010000},//  100 Keypad *⇒ *
        {0x56,2,0b00000010},//  105 Keypad -⇒ -
        {0x57,2,0b00100000},//  106 Keypad +⇒ +
        {0x58,1,0b01000000},//  108 Keypad Enter⇒ Enter
        {0x59,8,0b00000010},//  93 Keypad 1   ⇒１
        {0x5A,8,0b00000001},//  98 Keypad 2   
        {0x5B,7,0b00000001},//  103 Keypad 3   
        {0x5C,6,0b00000001},//  92 Keypad 4   
        {0x5D,6,0b00000010},//  97 Keypad 5   
        {0x5E,5,0b00000001},//  102 Keypad 6   
        {0x5F,5,0b00000010},//  91 Keypad 7   
        {0x60,4,0b00000001},//  96 Keypad 8   
        {0x61,5,0b00000010},//  101 Keypad 9   
        {0x62,3,0b00000001},//  99 Keypad 0   
        {0x63,3,0b00000100},//  104 Keypad .   
        {0x65,0,0b00000000},//  129 Application⇒割り当てなし   
        {0x67,0,0b00000000},//  303 ----- F13  ⇒割り当てなし   
        {0x68,0,0b00000000},//  300 ----- F14  ⇒割り当てなし   
        {0x69,0,0b00000000},//  301 ----- F15  ⇒割り当てなし   
        {0x6A,0,0b00000000},//  302 ----- Keypad =  ⇒割り当てなし   
        {0x85,0,0b00000000},//  304 ----- Keypad ,  ⇒割り当てなし  
        {0x87,2,0b00001000},//  56 ＼ _   ⇒ン　Shiftの隣
        {0x88,1,0b00001000},//  133 ひらがな カタカナ   ⇒　カナ
        {0x89,1,0b00000001},//  14 ￥ ｜   
        {0x8A,0,0b00000000},//  132 変換 ⇒割り当てなし
        {0x8B,8,0b00000100},//  131 無変換 ⇒ GRAPH  
        {0x90,0,0b00000000},//  306 -----カナ　⇒割り当てなし   
        {0x91,0,0b00000000},//  305 -----英数　⇒割り当てなし   
        {0xE0,8,0b00010000},//  58 Left Ctrl   
        {0xE1,8,0b00001000},//  44 Left Shift   
        {0xE2,0,0b00000000},//  60 Left Alt   ⇒割り当てなし
        {0xE3,0,0b00000000},//  127 Left Windows⇒割り当てなし   
        {0xE4,0,0b00000000},//  64 Right Ctrl⇒割り当てなし   
        {0xE5,1,0b00000100},//  57 Right Shift
        {0xE6,0,0b00000000},//  62 Right Alt  ⇒割り当てなし
        {0xE7,0,0b00000000},//  128 Right Windows  ⇒割り当てなし
        {0xFF,0,0} // endmark
    }

};
/* *****************************************************************************
 End of File
 */

void InitKeyMap(void)
{
    mtxKeyMap = xSemaphoreCreateMutex();
}
void KeyIdxReset(void) 
{
    KeyMapIdx = 1;      // 配列の[1]の上位４ビット
}
void SetKeyMode(uint8_t kym)
{
    KeyMode = kym;
}
uint8_t KeyIdxInc(void)
{
    KeyMapIdx++;
    if (KeyMapIdx > 10) {
        KeyMapIdx = 0;      // 何も押されない状態にしておく。これが正しいかは不明だが。
    }
    return KeyMapIdx;
}

uint8_t KeyIdxValue()
{
    //読み出しはバッファ１から
    return keyMap[1][KeyMapIdx];
}

KeyInfo findKey(uint8_t keyCode)
{

    KeyInfo ki;
    ki.dat = 0;
    if (keyCode == 0 ) {
        return ki;
    } else if (keyCode == 0x44) {
        KeyMode = 0;
        return ki;
    } else if (keyCode == 0x45) {
        KeyMode = 1;
        return ki;
    }
    for (int i = 0 ; cvt[KeyMode][i].keyCode != 0xFF;i++) {
        if (keyCode == cvt[KeyMode][i].keyCode) {
            ki.Base.row = cvt[KeyMode][i].Row;
            ki.Base.colmn = cvt[KeyMode][i].Column;
            break;
        }
    }
    return ki;
}
void UpdateUSBKeyReport()
{
    USBReportCount++;    
}


// キーマップのクリア　（フロント⇒バックに移動させる）
// 2回に一回、バッファクリア。
// もし、前回のクリアから、一度もUSBのキーレポートが来なかった場合、何もしない。
static int8_t clearCnt = 0;
bool  SwapKeyMap(void)
{
    if (USBReportCount == 0) return false;;
    
    for (uint8_t i=1;i<=9;i++) {
        keyMap[1][i]=keyMap[0][i];
        keyMap[0][i] = 0;
    }
    clearCnt++;
    USBReportCount = 0;
    return true;
}
void TblPrt(void)
{
    LCDLocate(0,0);
    for (uint8_t i=1;i<=9;i++) {
        LCDWriteText((uint8_t*)Byte2Hex(keyMap[0][i]));
    }
}


